In [39]:
#basic
import pandas as pd
import numpy as np
import datetime
import re
from pandas.tseries.holiday import USFederalHolidayCalendar

In [40]:
df = pd.read_csv('coast_df.csv')

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118295 entries, 0 to 118294
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  118295 non-null  int64
 1   datetime    118295 non-null  object
 2   ercot_load  118294 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.7+ MB

In [42]:
df.head(30)

    Unnamed: 0                    datetime   ercot_load
0            0  2009-01-01 01:00:00.003000  7300.317873
1            1  2009-01-01 01:59:59.997000  7174.769899
2            2         2009-01-01 03:00:00  7108.488956
3            3  2009-01-01 04:00:00.003000  7024.863242
4            4  2009-01-01 04:59:59.997000  7049.567942
5            5         2009-01-01 06:00:00  7257.599048
6            6  2009-01-01 07:00:00.003000  7335.601821
7            7  2009-01-01 07:59:59.997000  7359.628591
8            8         2009-01-01 09:00:00  7361.144903
9            9  2009-01-01 10:00:00.003000  7714.843729
10          10  2009-01-01 10:59:59.997000  7989.904995
11          11         2009-01-01 12:00:00  8096.268147
12          12  2009-01-01 13:00:00.003000  7975.795971
13          13  2009-01-01 13:59:59.997000  7757.421429
14          14         2009-01-01 15:00:00  7667.644931
15          15  2009-01-01 16:00:00.003000  7637.955922
16          16  2009-01-01 16:59:59.997000  7755.928934
17          17         2009-01-01 18:00:00  8094.981207
18          18  2009-01-01 19:00:00.003000  8432.994347
19          19  2009-01-01 19:59:59.997000  8310.114541
20          20         2009-01-01 21:00:00  8053.679423
21          21  2009-01-01 22:00:00.003000  7780.629878
22          22  2009-01-01 22:59:59.997000  7279.662495
23          23         2009-01-02 00:00:00  6786.339600
24          24  2009-01-02 01:00:00.003000  6567.030243
25          25  2009-01-02 01:59:59.997000  6277.111631
26          26         2009-01-02 03:00:00  6186.937126
27          27  2009-01-02 04:00:00.003000  6192.735066
28          28  2009-01-02 04:59:59.997000  6247.570880
29          29         2009-01-02 06:00:00  6551.083176

In [43]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118295 entries, 0 to 118294
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   datetime    118295 non-null  object
 1   ercot_load  118294 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.8+ MB

In [45]:
df.tail()

                datetime    ercot_load
118290  06/30/2022 20:00  14700.132848
118291  06/30/2022 21:00  14637.633680
118292  06/30/2022 22:00  14543.743791
118293  06/30/2022 23:00  14065.386852
118294  06/30/2022 24:00  13484.378935

In [46]:
df[~df.datetime.str.startswith('2')]

                datetime    ercot_load
70128   01/01/2017 01:00   8791.789509
70129   01/01/2017 02:00   8569.708419
70130   01/01/2017 03:00   8326.425638
70131   01/01/2017 04:00   8137.497400
70132   01/01/2017 05:00   8011.869581
...                  ...           ...
118290  06/30/2022 20:00  14700.132848
118291  06/30/2022 21:00  14637.633680
118292  06/30/2022 22:00  14543.743791
118293  06/30/2022 23:00  14065.386852
118294  06/30/2022 24:00  13484.378935

[48167 rows x 2 columns]

In [47]:
df.head(15)

                      datetime   ercot_load
0   2009-01-01 01:00:00.003000  7300.317873
1   2009-01-01 01:59:59.997000  7174.769899
2          2009-01-01 03:00:00  7108.488956
3   2009-01-01 04:00:00.003000  7024.863242
4   2009-01-01 04:59:59.997000  7049.567942
5          2009-01-01 06:00:00  7257.599048
6   2009-01-01 07:00:00.003000  7335.601821
7   2009-01-01 07:59:59.997000  7359.628591
8          2009-01-01 09:00:00  7361.144903
9   2009-01-01 10:00:00.003000  7714.843729
10  2009-01-01 10:59:59.997000  7989.904995
11         2009-01-01 12:00:00  8096.268147
12  2009-01-01 13:00:00.003000  7975.795971
13  2009-01-01 13:59:59.997000  7757.421429
14         2009-01-01 15:00:00  7667.644931

In [48]:
df.shape

(118295, 2)

In [49]:
df.datetime.isna().sum()

0

In [50]:
df.datetime[0]

'2009-01-01 01:00:00.003000'

In [51]:
df.datetime.apply(len).value_counts()

16    48162
26    46752
19    23376
20        5
Name: datetime, dtype: int64

In [52]:
df.datetime.str[:16]

0         2009-01-01 01:00
1         2009-01-01 01:59
2         2009-01-01 03:00
3         2009-01-01 04:00
4         2009-01-01 04:59
                ...
118290    06/30/2022 20:00
118291    06/30/2022 21:00
118292    06/30/2022 22:00
118293    06/30/2022 23:00
118294    06/30/2022 24:00
Name: datetime, Length: 118295, dtype: object

In [53]:
# 1. Datetime to string
# 2. Pull out first 19 characters
df.datetime = df.datetime.str[:16]

df.head(3)

           datetime   ercot_load
0  2009-01-01 01:00  7300.317873
1  2009-01-01 01:59  7174.769899
2  2009-01-01 03:00  7108.488956

In [54]:
df.datetime.str[:10]

0         2009-01-01
1         2009-01-01
2         2009-01-01
3         2009-01-01
4         2009-01-01
             ...
118290    06/30/2022
118291    06/30/2022
118292    06/30/2022
118293    06/30/2022
118294    06/30/2022
Name: datetime, Length: 118295, dtype: object

In [55]:
df.datetime.str[-5:]

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
118290    20:00
118291    21:00
118292    22:00
118293    23:00
118294    24:00
Name: datetime, Length: 118295, dtype: object

In [56]:
# 3. Deconstruct into date and time columns
df['date'] = df.datetime.str[:10]
df['time'] = df.datetime.str[-5:]

In [57]:
df

                datetime    ercot_load        date   time
0       2009-01-01 01:00   7300.317873  2009-01-01  01:00
1       2009-01-01 01:59   7174.769899  2009-01-01  01:59
2       2009-01-01 03:00   7108.488956  2009-01-01  03:00
3       2009-01-01 04:00   7024.863242  2009-01-01  04:00
4       2009-01-01 04:59   7049.567942  2009-01-01  04:59
...                  ...           ...         ...    ...
118290  06/30/2022 20:00  14700.132848  06/30/2022  20:00
118291  06/30/2022 21:00  14637.633680  06/30/2022  21:00
118292  06/30/2022 22:00  14543.743791  06/30/2022  22:00
118293  06/30/2022 23:00  14065.386852  06/30/2022  23:00
118294  06/30/2022 24:00  13484.378935  06/30/2022  24:00

[118295 rows x 4 columns]

In [58]:
pd.to_datetime(df.date)

0        2009-01-01
1        2009-01-01
2        2009-01-01
3        2009-01-01
4        2009-01-01
            ...
118290   2022-06-30
118291   2022-06-30
118292   2022-06-30
118293   2022-06-30
118294   2022-06-30
Name: date, Length: 118295, dtype: datetime64[ns]

In [59]:
# 4. Convert date column into datetime format
df['date'] = pd.to_datetime(df.date)
#NOTE: may need to come back here and specify datetime format to store it as
# if date addition or similar doesn't work

df

                datetime    ercot_load       date   time
0       2009-01-01 01:00   7300.317873 2009-01-01  01:00
1       2009-01-01 01:59   7174.769899 2009-01-01  01:59
2       2009-01-01 03:00   7108.488956 2009-01-01  03:00
3       2009-01-01 04:00   7024.863242 2009-01-01  04:00
4       2009-01-01 04:59   7049.567942 2009-01-01  04:59
...                  ...           ...        ...    ...
118290  06/30/2022 20:00  14700.132848 2022-06-30  20:00
118291  06/30/2022 21:00  14637.633680 2022-06-30  21:00
118292  06/30/2022 22:00  14543.743791 2022-06-30  22:00
118293  06/30/2022 23:00  14065.386852 2022-06-30  23:00
118294  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[118295 rows x 4 columns]

In [60]:
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
df.time.str[:2].value_counts()

01    7851
10    7851
22    7851
16    7851
13    7851
19    7851
07    7851
04    7851
09    4929
12    4929
15    4929
06    4929
18    4929
21    4929
03    4923
00    2922
02    2012
05    2007
08    2007
11    2007
14    2007
17    2007
20    2007
23    2007
24    2007
Name: time, dtype: int64

In [61]:
df[df.time.str.startswith('24')]

                datetime    ercot_load       date   time
70151   01/01/2017 24:00   9287.697168 2017-01-01  24:00
70175   01/02/2017 24:00   8935.488453 2017-01-02  24:00
70199   01/03/2017 24:00   8916.940782 2017-01-03  24:00
70223   01/04/2017 24:00   9784.496622 2017-01-04  24:00
70247   01/05/2017 24:00   9959.715620 2017-01-05  24:00
...                  ...           ...        ...    ...
118198  06/26/2022 24:00  16630.511189 2022-06-26  24:00
118222  06/27/2022 24:00  13866.196748 2022-06-27  24:00
118246  06/28/2022 24:00  14675.349674 2022-06-28  24:00
118270  06/29/2022 24:00  14877.471376 2022-06-29  24:00
118294  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[2007 rows x 4 columns]

In [62]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  2016-01-02 22:00  10445.642738 2016-01-02  22:00
61390  2016-01-02 22:59  10095.253700 2016-01-02  22:59
61391  2016-01-03 00:00   9695.159800 2016-01-03  00:00
61392  2016-01-03 01:00   9316.843422 2016-01-03  01:00
61393  2016-01-03 01:59   9091.157271 2016-01-03  01:59

In [63]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2021 22:00  16173.913328 2021-06-26  22:00
109437  06/26/2021 23:00  15537.893378 2021-06-26  23:00
109438  06/26/2021 24:00  14816.228809 2021-06-26  24:00
109439  06/27/2021 01:00  14102.087483 2021-06-27  01:00
109440  06/27/2021 02:00  13468.970119 2021-06-27  02:00

In [64]:
# 5. Find any time where starts with 24, then for that index, add one day to to date column and update time to 00

In [65]:
df.loc[df.time.str.startswith('24'),'date'] = df.date + datetime.timedelta(days=1)

In [66]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  2016-01-02 22:00  10445.642738 2016-01-02  22:00
61390  2016-01-02 22:59  10095.253700 2016-01-02  22:59
61391  2016-01-03 00:00   9695.159800 2016-01-03  00:00
61392  2016-01-03 01:00   9316.843422 2016-01-03  01:00
61393  2016-01-03 01:59   9091.157271 2016-01-03  01:59

In [67]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2021 22:00  16173.913328 2021-06-26  22:00
109437  06/26/2021 23:00  15537.893378 2021-06-26  23:00
109438  06/26/2021 24:00  14816.228809 2021-06-27  24:00
109439  06/27/2021 01:00  14102.087483 2021-06-27  01:00
109440  06/27/2021 02:00  13468.970119 2021-06-27  02:00

In [68]:
df.loc[109438,'time']

'24:00'

In [69]:
re.sub(r'24:','00:',df.loc[109438,'time'])

'00:00'

In [70]:
df.time.apply(lambda x: re.sub(r'24:','00:',x))

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
118290    20:00
118291    21:00
118292    22:00
118293    23:00
118294    00:00
Name: time, Length: 118295, dtype: object

In [71]:
df.time = df.time.apply(lambda x: re.sub(r'24:','00:',x))

In [72]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  2016-01-02 22:00  10445.642738 2016-01-02  22:00
61390  2016-01-02 22:59  10095.253700 2016-01-02  22:59
61391  2016-01-03 00:00   9695.159800 2016-01-03  00:00
61392  2016-01-03 01:00   9316.843422 2016-01-03  01:00
61393  2016-01-03 01:59   9091.157271 2016-01-03  01:59

In [73]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2021 22:00  16173.913328 2021-06-26  22:00
109437  06/26/2021 23:00  15537.893378 2021-06-26  23:00
109438  06/26/2021 24:00  14816.228809 2021-06-27  00:00
109439  06/27/2021 01:00  14102.087483 2021-06-27  01:00
109440  06/27/2021 02:00  13468.970119 2021-06-27  02:00

In [74]:
df.date.astype(str)

0         2009-01-01
1         2009-01-01
2         2009-01-01
3         2009-01-01
4         2009-01-01
             ...
118290    2022-06-30
118291    2022-06-30
118292    2022-06-30
118293    2022-06-30
118294    2022-07-01
Name: date, Length: 118295, dtype: object

In [75]:
# 6. Check indices where known issue
df['new_datetime'] = df.date.astype(str) + ' ' + df.time

df

                datetime    ercot_load       date   time      new_datetime
0       2009-01-01 01:00   7300.317873 2009-01-01  01:00  2009-01-01 01:00
1       2009-01-01 01:59   7174.769899 2009-01-01  01:59  2009-01-01 01:59
2       2009-01-01 03:00   7108.488956 2009-01-01  03:00  2009-01-01 03:00
3       2009-01-01 04:00   7024.863242 2009-01-01  04:00  2009-01-01 04:00
4       2009-01-01 04:59   7049.567942 2009-01-01  04:59  2009-01-01 04:59
...                  ...           ...        ...    ...               ...
118290  06/30/2022 20:00  14700.132848 2022-06-30  20:00  2022-06-30 20:00
118291  06/30/2022 21:00  14637.633680 2022-06-30  21:00  2022-06-30 21:00
118292  06/30/2022 22:00  14543.743791 2022-06-30  22:00  2022-06-30 22:00
118293  06/30/2022 23:00  14065.386852 2022-06-30  23:00  2022-06-30 23:00
118294  06/30/2022 24:00  13484.378935 2022-07-01  00:00  2022-07-01 00:00

[118295 rows x 5 columns]

In [76]:
df[df.new_datetime.str.startswith('2017-03-12')]

               datetime   ercot_load       date   time      new_datetime
71807  03/11/2017 24:00  9120.385718 2017-03-12  00:00  2017-03-12 00:00
71808  03/12/2017 01:00  8579.644600 2017-03-12  01:00  2017-03-12 01:00
71809  03/12/2017 02:00  8251.748166 2017-03-12  02:00  2017-03-12 02:00
71810  03/12/2017 04:00  8016.291377 2017-03-12  04:00  2017-03-12 04:00
71811  03/12/2017 05:00  7894.080492 2017-03-12  05:00  2017-03-12 05:00
71812  03/12/2017 06:00  7871.827685 2017-03-12  06:00  2017-03-12 06:00
71813  03/12/2017 07:00  8034.402546 2017-03-12  07:00  2017-03-12 07:00
71814  03/12/2017 08:00  8192.101434 2017-03-12  08:00  2017-03-12 08:00
71815  03/12/2017 09:00  8395.224430 2017-03-12  09:00  2017-03-12 09:00
71816  03/12/2017 10:00  8817.761577 2017-03-12  10:00  2017-03-12 10:00
71817  03/12/2017 11:00  9218.897392 2017-03-12  11:00  2017-03-12 11:00
71818  03/12/2017 12:00  9535.095465 2017-03-12  12:00  2017-03-12 12:00
71819  03/12/2017 13:00  9651.844482 2017-03-12  13:00  2017-03-12 13:00
71820  03/12/2017 14:00  9603.323580 2017-03-12  14:00  2017-03-12 14:00
71821  03/12/2017 15:00  9460.848568 2017-03-12  15:00  2017-03-12 15:00
71822  03/12/2017 16:00  9295.347442 2017-03-12  16:00  2017-03-12 16:00
71823  03/12/2017 17:00  9204.943138 2017-03-12  17:00  2017-03-12 17:00
71824  03/12/2017 18:00  9194.145087 2017-03-12  18:00  2017-03-12 18:00
71825  03/12/2017 19:00  9231.290243 2017-03-12  19:00  2017-03-12 19:00
71826  03/12/2017 20:00  9635.354626 2017-03-12  20:00  2017-03-12 20:00
71827  03/12/2017 21:00  9880.170733 2017-03-12  21:00  2017-03-12 21:00
71828  03/12/2017 22:00  9707.682717 2017-03-12  22:00  2017-03-12 22:00
71829  03/12/2017 23:00  9371.168940 2017-03-12  23:00  2017-03-12 23:00

In [77]:
tz_df.index

RangeIndex(start=0, stop=118295, step=1)

In [78]:
mar_adj_dates = ['2017-03-12 02:00:00',
                '2018-03-11 02:00:00',
                '2019-03-10 02:00:00',
                '2020-03-08 02:00:00',
                '2021-03-14 02:00:00',
                '2022-03-13 02:00:00']

nov_adj_ind = [77520,
                86256,
                94992,
                103728,
                112632]

In [79]:
tz_df.new_datetime.astype(str)

0         2009-01-01 01:00:00
1         2009-01-01 01:59:00
2         2009-01-01 03:00:00
3         2009-01-01 04:00:00
4         2009-01-01 04:59:00
                 ...
118290    2022-06-30 20:00:00
118291    2022-06-30 21:00:00
118292    2022-06-30 22:00:00
118293    2022-06-30 23:00:00
118294    2022-07-01 00:00:00
Name: new_datetime, Length: 118295, dtype: object

In [80]:
mar_adj_ind = list(tz_df[tz_df.new_datetime.astype(str).isin(mar_adj_dates)].index)

In [81]:
mar_adj_ind

[71809, 80545, 89281, 98017, 106921, 115657]

In [82]:
# to the March, we are adding 1 hour to the 2am time 
#. b/c ERCOT skips 3am, when it should skip 2am
tz_df.loc[mar_adj_ind,'new_datetime'] = tz_df.loc[mar_adj_ind,'new_datetime'] + datetime.timedelta(hours=1)

#to the November, we are subtracting 1 hour from the first 2am, 
#  as there are supposed to be two 1ams, not two 2ams
tz_df.loc[nov_adj_ind,'new_datetime'] = tz_df.loc[nov_adj_ind,'new_datetime'] - datetime.timedelta(hours=1)

In [83]:
tz_df.loc[mar_adj_ind]

                datetime    ercot_load       date   time        new_datetime
71809   03/12/2017 02:00   8251.748166 2017-03-12  02:00 2017-03-12 03:00:00
80545   03/11/2018 02:00   9540.806925 2018-03-11  02:00 2018-03-11 03:00:00
89281   03/10/2019 02:00   9347.664413 2019-03-10  02:00 2019-03-10 03:00:00
98017   03/08/2020 02:00   9363.854764 2020-03-08  02:00 2020-03-08 03:00:00
106921  03/14/2021 02:00   9590.242305 2021-03-14  02:00 2021-03-14 03:00:00
115657  03/13/2022 02:00  11830.051429 2022-03-13  02:00 2022-03-13 03:00:00

In [84]:
tz_df.loc[nov_adj_ind]

                datetime    ercot_load       date   time        new_datetime
77520   11/05/2017 02:00  10677.703425 2017-11-05  02:00 2017-11-05 01:00:00
86256   11/04/2018 02:00   8919.548072 2018-11-04  02:00 2018-11-04 01:00:00
94992   11/03/2019 02:00   9028.618802 2019-11-03  02:00 2019-11-03 01:00:00
103728  11/01/2020 02:00   9071.565670 2020-11-01  02:00 2020-11-01 01:00:00
112632  11/07/2021 02:00   9730.091432 2021-11-07  02:00 2021-11-07 01:00:00

In [85]:
tz_df.loc[71805:71810]

               datetime   ercot_load       date   time        new_datetime
71805  03/11/2017 22:00  9960.180573 2017-03-11  22:00 2017-03-11 22:00:00
71806  03/11/2017 23:00  9566.640831 2017-03-11  23:00 2017-03-11 23:00:00
71807  03/11/2017 24:00  9120.385718 2017-03-12  00:00 2017-03-12 00:00:00
71808  03/12/2017 01:00  8579.644600 2017-03-12  01:00 2017-03-12 01:00:00
71809  03/12/2017 02:00  8251.748166 2017-03-12  02:00 2017-03-12 03:00:00
71810  03/12/2017 04:00  8016.291377 2017-03-12  04:00 2017-03-12 04:00:00

In [87]:
list(tz_df.loc[nov_adj_ind,'new_datetime'])

[Timestamp('2017-11-05 01:00:00'),
 Timestamp('2018-11-04 01:00:00'),
 Timestamp('2019-11-03 01:00:00'),
 Timestamp('2020-11-01 01:00:00'),
 Timestamp('2021-11-07 01:00:00')]

In [88]:
#8.5 Make it ignore daylight savings somehow
# tz_df = df.copy()
tz_df['new_datetime'] = pd.to_datetime(df.new_datetime)
tz_df = tz_df.set_index('new_datetime').tz_localize(tz='US/Central',ambiguous='infer')
# infer_arr = np.array([True]*tz_df.shape[0])
# tz_df = tz_df.set_index('new_datetime').tz_localize(tz='US/Central',ambiguous=infer_arr)
tz_df.loc['2010-11-07']

AmbiguousTimeError: 2017-11-05 01:00:00

In [ ]:
tz_df.loc['2017-03-12']

In [ ]:
tz_df.loc['2010-11-07'].index.hour

In [ ]:
#CONVERT
# tz_df.tz_convert
# #see cool things
# tz_df.loc['2010-11-07']

##### RESUME NORMALITY HERE

In [ ]:
# 9. Convert datetime column to datetime
df['new_datetime'] = pd.to_datetime(df.new_datetime)

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.loc[61389:61393]

In [ ]:
df.loc[109436:109440]

In [ ]:
df.new_datetime = df.new_datetime.dt.round("H")

df

In [ ]:
# 1. Datetime to string
# df.datetime = df.datetime[:19]
# 2. Pull out first 16 characters
# 3. Deconstruct into date and time columns
# 4. Convert date column into datetime format
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
# 6. Check indices where known issue
# 7. Convert date column back to string
# 8. Concat date and time column >> datetime
# 9. Convert datetime column to datetime
# 10. Perform dt.round

In [ ]:
#drop unneeded columns
df.drop(columns=['datetime','date','time'],inplace=True)

In [ ]:
df.head()

In [ ]:
#rename column and set as index
df.rename(columns={'new_datetime':'datetime'},inplace=True)
df = df.set_index('datetime').sort_index()
df.head()

### Drop these actions in a function

In [ ]:
def clean_ercot_datetime(df):
    '''
    This function is designed to take in our coast_df.csv and clean up the datetimes that were provided.
    - gets dates in same format and stored as datetime
    - adjusts any 24:00 entries to be 00: the following day
    - Stores the datetime as the index
    
    Returns: Pandas Dateframe - w/ datetime index and load column
    Parameters: df: pandas dataframe - expecting our coast_df.csv file
    '''
    # 1. Pull out first 16 characters
    df.datetime = df.datetime.str[:16]
    # 2. Deconstruct into date and time columns
    df['date'] = df.datetime.str[:10]
    df['time'] = df.datetime.str[-5:]
    # 3. Convert date column into datetime format
    df['date'] = pd.to_datetime(df.date)
    
    # 4. Find any time where starts with 24, then for that index, add one day to to date column then update time to 00
    #For all indices w/ a time that starts with 24, add one day to the date
    df.loc[df.time.str.startswith('24'),'date'] = df.date + datetime.timedelta(days=1)
    #Replace all '24:' in time with '00:'
    df.time = df.time.apply(lambda x: re.sub(r'24:','00:',x))

    # 5. Convert date column back to string and Concat date and time column >> datetime
    df['new_datetime'] = df.date.astype(str) + ' ' + df.time
    
    # 6. Convert new datetime column to datetime
    df['new_datetime'] = pd.to_datetime(df.new_datetime)
    
    # 7. Perform dt.round
    df.new_datetime = df.new_datetime.dt.round("H")
    
    # 8. Drop old date/time columns and index
    df.drop(columns=['datetime','date','time','Unnamed: 0'],inplace=True)
    
    # 9. Rename datetime column and set as index
    df.rename(columns={'new_datetime':'datetime'},inplace=True)
    df = df.set_index('datetime').sort_index()
    
    return df

##### Test function

In [ ]:
test_clean = pd.read_csv('coast_df.csv')
test_clean

In [ ]:
test_clean = clean_ercot_datetime(test_clean)
test_clean

### Add new features on day type

In [ ]:
df2 = test_clean.copy()

In [ ]:
df2.info()

In [ ]:
df2['dow'] = df2.index.day_name()
df2

In [ ]:
df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1).head(26)

In [ ]:
df2['is_weekday'] = df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1)

In [ ]:
df2.head(25)

In [ ]:
2/7

In [ ]:
1- df2.is_weekday.mean()

In [ ]:
#NOW figure out our holiday options
cal = USFederalHolidayCalendar() #

In [ ]:
cal.rules

Looks like the usfederal calendar from pandas already contains the logic on observance days

In [ ]:
df2.index[0]

In [ ]:
df2.index[-1]

In [ ]:
#Let's look at the holidays
start = df2.index[0] - datetime.timedelta(days=1) #this is need b/c it will skip 1/1/2010 (I think b/c it starts at one hour into that day)
end = df2.index[-1] + datetime.timedelta(days=1)
obsholidays = cal.holidays(start, end) #returns datetime index
obsholiday_names = cal.holidays(start, end, return_name = True) #returns series
print(f'start date: {start}\nend date: {end}')

In [ ]:
obsholidays

In [ ]:
type(obsholiday_names)

In [ ]:
#convert the dates from above into day of week, then see distribution
pd.Series(pd.to_datetime(obsholiday_names.index).dayofweek).value_counts()

No Saturdays/Sundays shows that this is only OBSERVED holidays

In [ ]:
df2.index.isin(obsholidays)

In [ ]:
df2.index.isin(obsholidays).astype(int)

In [ ]:
df2.index.isin(obsholidays).sum()

In [ ]:
df2['is_obs_holiday'] = df2.index.isin(obsholidays).astype(int)

In [ ]:
df2.head(20)

**NOT WORKING** This is I think because it doesn't like the time on it.  It may be counting that as the next day (similar to how a start datetime of 1am on 1/1 didn't return us the 1/1 holiday)

**Instead:** convert datetime to datetime (days), then check the list

In [ ]:
pd.to_datetime(df2.index,unit='D').isin(obsholidays).astype(int) #didn't work

In [ ]:
df2.index.date

In [ ]:
pd.Series(df2.index.date).isin(obsholidays).astype(int)

In [ ]:
pd.Series(df2.index).dt.date

In [ ]:
obsholidays.date

In [ ]:
pd.Series(df2.index).dt.date.isin(list(obsholidays.date))

**Notes:** both these really seemed to need to be converted to dates, then compared

In [ ]:
#convert index to series to grabe date then use isin 
#(needs to be series, else getting date converts to Numpy array which can't use isin *insert dramatic sigh here*
pd.Series(df2.index).dt.date.isin(obsholidays.date).astype(int)

In [ ]:
#let's try this again!
df2['is_obs_holiday'] = pd.Series(df2.index,index=df2.index).dt.date.isin(obsholidays.date).astype(int)

In [ ]:
df2.is_obs_holiday.mean()

#### Combine prep into function

In [ ]:
from pandas.tseries.holiday import USFederalHolidayCalendar

def create_day_columns(df2):
    '''
    Expects the cleaned ERCOT dataframe, returns the dataframe with new columns for:
    - dow: Day of week (category EX: Monday)
    - is_weekday: 1 if day is a weekday (M-F), else 0
    
    '''
    #create day of week category
    df2['dow'] = df2.index.day_name()
    #create bool is_weekday column
    df2['is_weekday'] = df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1)
    
    #get holiday information
    start = df2.index[0] - datetime.timedelta(days=1) #this is need b/c it will skip 1/1/2010 (I think b/c it starts at one hour into that day)
    end = df2.index[-1] + datetime.timedelta(days=1)
    obsholidays = cal.holidays(start, end) #returns datetime index
    #Create is observed holiday column
    df2['is_obs_holiday'] = pd.Series(df2.index,index=df2.index).dt.date.isin(obsholidays.date).astype(int)
    
    return df2

In [ ]:
test_holiday = pd.read_csv('coast_df.csv')
test_holiday = clean_ercot_datetime(test_holiday)
test_holiday = create_day_columns(test_holiday)
test_holiday

### Combine into Prep Ercot function

In [ ]:
def prep_ercot():
    '''
    Preps and the ercot dataframe - requires coast_df.csv file in working directory
    
    Returns: Pandas Dataframe
    '''
    #load ercot data
    df = pd.read_csv('coast_df.csv')
    
    #clean up datetime info
    df = clean_ercot_datetime(df)
    
    #create new day type features
    df = create_day_columns(df)
    
    return(df)

##### Test function

In [ ]:
df = prep_ercot()

In [ ]:
df

In [ ]:
df.info()

In [ ]:
#STORE for now
df.to_csv('prepped_ercot.csv')

In [ ]:
#now confirm I can pull it
test = pd.read_csv('prepped_ercot.csv')
test

In [ ]:
#best pull method
test = pd.read_csv('prepped_ercot.csv',index_col='datetime')
test

In [ ]:
test.info()

In [ ]:
test.index

In [ ]:
test2 = pd.read_csv('prepped_ercot.csv',index_col='datetime',parse_dates=['datetime'])

In [ ]:
test2.info()

In [ ]:
def get_ercot_df():
    '''
    Retrieves ERCOT data from local csv, and returns as dataframe
    '''
    return pd.read_csv('prepped_ercot.csv',index_col='datetime',parse_dates=['datetime'])

In [ ]:
df3 = get_ercot_df()
df3.info()

##### Trim dataframe

In [ ]:
df3.index.min()

In [ ]:
df3.index.max()

In [ ]:
df3.tail()

In [ ]:
df3.loc['2010-01':'2022-06']

In [ ]:
df3 = df3.loc['2010-01':'2022-06']

In [ ]:
df3.index.min()

In [ ]:
df3.index.max()

##### Now look at Nans

In [ ]:
test2[test2.ercot_load.isna()]

In [ ]:
test2['2016-11-06':'2016-11-07']